{
  "number": 73,
  "name": "Al-Muzzammil",
  "nameArabic": "المزمل",
  "verses": [
    {
      "number": 1,
      "arabic": "يَا أَيُّهَا الْمُزَّمِّلُ",
      "transliteration": "Ya ayyuha al-muzzammil",
      "translation": "O you who wraps himself [in clothing]"
    },
    {
      "number": 2,
      "arabic": "قُمِ اللَّيْلَ إِلَّا قَلِيلًا",
      "transliteration": "Qumi al-layla illa qalila",
      "translation": "Arise [to pray] the night, except for a little"
    },
    {
      "number": 3,
      "arabic": "نِّصْفَهُ أَوِ انقُصْ مِنْهُ قَلِيلًا",
      "transliteration": "Nisfahu aw inqus minhu qalila",
      "translation": "[Or] half of it - or subtract from it a little"
    },
    {
      "number": 4,
      "arabic": "أَوْ زِدْ عَلَيْهِ وَرَتِّلِ الْقُرْآنَ تَرْتِيلًا",
      "transliteration": "Aw zid 'alayhi wa rattili al-qur'ana tartila",
      "translation": "Or add to it, and recite the Qur'an with measured recitation"
    },
    {
      "number": 5,
      "arabic": "إِنَّا سَنُلْقِي عَلَيْكَ قَوْلًا ثَقِيلًا",
      "transliteration": "Inna sanulqi 'alayka qawlan thaqila",
      "translation": "Indeed, We will cast upon you a heavy word"
    },
    {
      "number": 6,
      "arabic": "إِنَّ نَاشِئَةَ اللَّيْلِ هِيَ أَشَدُّ وَطْئًا وَأَقْوَمُ قِيلًا",
      "transliteration": "Inna nashi'ata al-layli hiya ashaddu wat'an wa aqwamu qila",
      "translation": "Indeed, the hours of the night are more effective for concurrence [of heart and tongue] and more suitable for words"
    },
    {
      "number": 7,
      "arabic": "إِنَّ لَكَ فِي النَّهَارِ سَبْحًا طَوِيلًا",
      "transliteration": "Inna laka fi an-nahari sabhan tawila",
      "translation": "Indeed, for you by day is prolonged occupation"
    },
    {
      "number": 8,
      "arabic": "وَاذْكُرِ اسْمَ رَبِّكَ وَتَبَتَّلْ إِلَيْهِ تَبْتِيلًا",
      "transliteration": "Wa adhkuri isma rabbika wa tabattal ilayhi tabtila",
      "translation": "And remember the name of your Lord and devote yourself to Him with [complete] devotion"
    },
    {
      "number": 9,
      "arabic": "رَّبُّ الْمَشْرِقِ وَالْمَغْرِبِ لَا إِلَٰهَ إِلَّا هُوَ فَاتَّخِذْهُ وَكِيلًا",
      "transliteration": "Rabbu al-mashriqi wa al-maghribi la ilaha illa huwa fa-ittakhidhhu wakila",
      "translation": "[He is] the Lord of the East and the West; there is no deity except Him, so take Him as Disposer of [your] affairs"
    },
    {
      "number": 10,
      "arabic": "وَاصْبِرْ عَلَىٰ مَا يَقُولُونَ وَاهْجُرْهُمْ هَجْرًا جَمِيلًا",
      "transliteration": "Wa asbir 'ala ma yaquluna wa ahjurhum hijran jamila",
      "translation": "And be patient over what they say and avoid them with gracious avoidance"
    },
    {
      "number": 11,
      "arabic": "وَذَرْنِي وَالْمُكَذِّبِينَ أُولِي النَّعْمَةِ وَمَهِّلْهُمْ قَلِيلًا",
      "transliteration": "Wa dharni wa al-mukaththibina uli an-na'mati wa mahhilhum qalila",
      "translation": "And leave Me with [the matter of] the deniers, those of ease [in life], and allow them respite a little"
    },
    {
      "number": 12,
      "arabic": "إِنَّ لَدَيْنَا أَنكَالًا وَجَحِيمًا",
      "transliteration": "Inna ladayna ankalan wa jahima",
      "translation": "Indeed, with Us [for them] are shackles and burning fire"
    },
    {
      "number": 13,
      "arabic": "وَطَعَامًا ذَا غُصَّةٍ وَعَذَابًا أَلِيمًا",
      "transliteration": "Wa ta'aman dha ghusatin wa 'adhaban alima",
      "translation": "And food that chokes and a painful punishment"
    },
    {
      "number": 14,
      "arabic": "يَوْمَ تَرْجُفُ الْأَرْضُ وَالْجِبَالُ وَكَانَتِ الْجِبَالُ كَثِيبًا مَّهِيلًا",
      "transliteration": "Yawma tarjufu al-ardu wa al-jibalu wa kanati al-jibalu kathiban mahila",
      "translation": "On the Day the earth and the mountains will convulse and the mountains will become a heap of sand pouring down"
    },
    {
      "number": 15,
      "arabic": "إِنَّا أَرْسَلْنَا إِلَيْكُمْ رَسُولًا شَاهِدًا عَلَيْكُمْ كَمَا أَرْسَلْنَا إِلَىٰ فِرْعَوْنَ رَسُولًا",
      "transliteration": "Inna arsalna ilaykum rasulan shahidan 'alaykum kama arsalna ila fir'awna rasula",
      "translation": "Indeed, We have sent to you a Messenger as a witness upon you just as We sent to Pharaoh a messenger"
    },
    {
      "number": 16,
      "arabic": "فَعَصَىٰ فِرْعَوْنُ الرَّسُولَ فَأَخَذْنَاهُ أَخْذًا وَبِيلًا",
      "transliteration": "Fa-'asa fir'awnu ar-rasula fa-akhadhnahu akhdhan wabila",
      "translation": "But Pharaoh disobeyed the messenger, so We seized him with a ruinous seizure"
    },
    {
      "number": 17,
      "arabic": "فَكَيْفَ تَتَّقُونَ إِن كَفَرْتُمْ يَوْمًا يَجْعَلُ الْوِلْدَانَ شِيبًا",
      "transliteration": "Fakayfa tattaquna in kafartum yawman yaj'alu al-wildana shiba",
      "translation": "Then how can you fear, if you disbelieve, a Day that will make the children white-headed?"
    },
    {
      "number": 18,
      "arabic": "السَّمَاءُ مُنفَطِرٌ بِهِ ۚ كَانَ وَعْدُهُ مَفْعُولًا",
      "transliteration": "As-sama'u munfatirun bih kana wa'duhu maf'ula",
      "translation": "The heaven will break apart therefrom; ever is His promise fulfilled"
    },
    {
      "number": 19,
      "arabic": "إِنَّ هَٰذِهِ تَذْكِرَةٌ ۖ فَمَن شَاءَ اتَّخَذَ إِلَىٰ رَبِّهِ سَبِيلًا",
      "transliteration": "Inna hadhihi tadhkiratun fa-man sha'a ittakhadha ila rabbihi sabila",
      "translation": "Indeed, this is a reminder, so whoever wills may take to his Lord a way"
    },
    {
      "number": 20,
      "arabic": "إِنَّ رَبَّكَ يَعْلَمُ أَنَّكَ تَقُومُ أَدْنَىٰ مِن ثُلُثَيِ اللَّيْلِ وَنِصْفَهُ وَثُلُثَهُ وَطَائِفَةٌ مِّنَ الَّذِينَ مَعَكَ ۚ وَاللَّهُ يُقَدِّرُ اللَّيْلَ وَالنَّهَارَ ۚ عَلِمَ أَن لَّن تُحْصُوهُ فَتَابَ عَلَيْكُمْ ۖ فَاقْرَءُوا مَا تَيَسَّرَ مِنَ الْقُرْآنِ ۚ عَلِمَ أَن سَيَكُونُ مِنكُم مَّرْضَىٰ ۙ وَآخَرُونَ يَضْرِبُونَ فِي الْأَرْضِ يَبْتَغُونَ مِن فَضْلِ اللَّهِ ۙ وَآخَرُونَ يُقَاتِلُونَ فِي سَبِيلِ اللَّهِ ۖ فَاقْرَءُوا مَا تَيَسَّرَ مِنْهُ ۚ وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ وَأَقْرِضُوا اللَّهَ قَرْضًا حَسَنًا ۚ وَمَا تُقَدِّمُوا لِأَنفُسِكُم مِّنْ خَيْرٍ تَجِدُوهُ عِندَ اللَّهِ هُوَ خَيْرًا وَأَعْظَمَ أَجْرًا ۚ وَاسْتَغْفِرُوا اللَّهَ ۖ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ",
      "transliteration": "Inna rabbaka ya'lamu annaka taqumu adna min thuluthayi al-layli wa nisfahu wa thuluthahu wa ta'ifatun min alladhina ma'ak wa allahu yuqaddiru al-layla wa an-nahar 'alima an lan tuhsuhu fa-taba 'alaykum fa-iqra'u ma tayassara mina al-qur'ani 'alima an sayakunu minkum marda wa akharuna yadribuna fi al-ardi yabtaghuna min fadli allahi wa akharuna yuqatiluna fi sabili allahi fa-iqra'u ma tayassara minhu wa aqimu as-salata wa atu az-zakata wa aqridu allaha qardan hasanan wa ma tuqaddimu li-anfusikum min khayrin tajiduhu 'inda allahi huwa khayran wa a'zama ajran wa istaghfiru allaha inna allaha ghafurun rahim",
      "translation": "Indeed, your Lord knows that you stand [in prayer] almost two thirds of the night or half of it or a third of it, and [so do] a group of those with you. And Allah determines [the extent of] the night and the day. He has known that you [Muslims] will not be able to do it and has turned to you in forgiveness, so recite what is easy [for you] of the Qur'an. He has known that there will be among you those who are ill and others traveling throughout the land seeking [something] of the bounty of Allah and others fighting for the cause of Allah. So recite what is easy from it and establish prayer and give zakah and loan Allah a good loan. And whatever good you put forward for yourselves - you will find it with Allah. It is better and greater in reward. And seek forgiveness of Allah. Indeed, Allah is Forgiving and Merciful"
    }
  ]
}

