{
  "number": 66,
  "name": "At-Tahrim",
  "nameArabic": "التحريم",
  "verses": [
    {
      "number": 1,
      "arabic": "يَا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَا أَحَلَّ اللَّهُ لَكَ ۖ تَبْتَغِي مَرْضَاتَ أَزْوَاجِكَ ۚ وَاللَّهُ غَفُورٌ رَّحِيمٌ",
      "transliteration": "Ya ayyuha an-nabiyyu lima tuharrimu ma ahalla allahu laka tabtaghi mardata azwajika wa allahu ghafurun rahim",
      "translation": "O Prophet, why do you prohibit [yourself from] what Allah has made lawful for you, seeking the approval of your wives? And Allah is Forgiving and Merciful"
    },
    {
      "number": 2,
      "arabic": "قَدْ فَرَضَ اللَّهُ لَكُمْ تَحِلَّةَ أَيْمَانِكُمْ ۚ وَاللَّهُ مَوْلَاكُمْ ۖ وَهُوَ الْعَلِيمُ الْحَكِيمُ",
      "transliteration": "Qad farada allahu lakum tahillata aymanikum wa allahu mawlakum wa huwa al-'alimu al-hakim",
      "translation": "Allah has already ordained for you [Muslims] the dissolution of your oaths. And Allah is your protector, and He is the Knowing, the Wise"
    },
    {
      "number": 3,
      "arabic": "وَإِذْ أَسَرَّ النَّبِيُّ إِلَىٰ بَعْضِ أَزْوَاجِهِ حَدِيثًا فَلَمَّا نَبَّأَتْ بِهِ وَأَظْهَرَهُ اللَّهُ عَلَيْهِ عَرَّفَ بَعْضَهُ وَأَعْرَضَ عَن بَعْضٍ ۖ فَلَمَّا نَبَّأَهَا بِهِ قَالَتْ مَنْ أَنبَأَكَ هَٰذَا ۖ قَالَ نَبَّأَنِي الْعَلِيمُ الْخَبِيرُ",
      "transliteration": "Wa idh asarra an-nabiyyu ila ba'di azwajihi hadithan fa-lamma nabba'at bihi wa azharahu allahu 'alayhi 'arrafa ba'dahu wa a'rada 'an ba'din fa-lamma nabba'aha bihi qalat man anba'aka hadha qala nabba'ani al-'alimu al-khabir",
      "translation": "And [remember] when the Prophet confided to one of his wives a statement; and when she informed [another] of it and Allah showed it to him, he made known part of it and ignored a part. And when he informed her about it, she said, 'Who told you this?' He said, 'I was informed by the Knowing, the Aware'"
    },
    {
      "number": 4,
      "arabic": "إِن تَتُوبَا إِلَى اللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا ۖ وَإِن تَظَاهَرَا عَلَيْهِ فَإِنَّ اللَّهَ هُوَ مَوْلَاهُ وَجِبْرِيلُ وَصَالِحُ الْمُؤْمِنِينَ ۖ وَالْمَلَائِكَةُ بَعْدَ ذَٰلِكَ ظَهِيرٌ",
      "transliteration": "In tatuba ila allahi faqad saghat qulubukuma wa in tazaharay 'alayhi fa-inna allaha huwa mawlahu wa jibrilu wa salihu al-mu'minina wa al-mala'ikatu ba'da dhalika zahir",
      "translation": "If you two [wives] repent to Allah, [it is best], for your hearts have deviated. But if you cooperate against him - then indeed Allah is his protector, and Gabriel and the righteous of the believers and the angels, moreover, are [his] assistants"
    },
    {
      "number": 5,
      "arabic": "عَسَىٰ رَبُّهُ إِن طَلَّقَكُنَّ أَن يُبْدِلَهُ أَزْوَاجًا خَيْرًا مِّنكُنَّ مُسْلِمَاتٍ مُّؤْمِنَاتٍ قَانِتَاتٍ تَائِبَاتٍ عَابِدَاتٍ سَائِحَاتٍ ثَيِّبَاتٍ وَأَبْكَارًا",
      "transliteration": "Asa rabbuhu in tallaqakunna an yubdilahu azwajan khayran minkunna muslimat mu'minat qanitat ta'ibat 'abidat sa'ihat thayyibatin wa abkaran",
      "translation": "Perhaps his Lord, if he divorced you [all], would substitute for him wives better than you - submitting [to Allah], believing, devoutly obedient, repentant, worshipping, and traveling [for Hajj and 'umrah] - [ones] previously married and virgins"
    },
    {
      "number": 6,
      "arabic": "يَا أَيُّهَا الَّذِينَ آمَنُوا قُوا أَنفُسَكُمْ وَأَهْلِيكُمْ نَارًا وَقُودُهَا النَّاسُ وَالْحِجَارَةُ عَلَيْهَا مَلَائِكَةٌ غِلَاظٌ شِدَادٌ لَّا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ",
      "transliteration": "Ya ayyuha alladhina amanu qu anfusakum wa ahlikum naran waquduha an-nasu wa al-hijaratu 'alayha mala'ikatun ghilazun shidadun la ya'suna allaha ma amarahum wa yaf'aluna ma yu'marun",
      "translation": "O you who have believed, protect yourselves and your families from a Fire whose fuel is people and stones, over which are [appointed] angels, harsh and severe; they do not disobey Allah in what He commands them but do what they are commanded"
    },
    {
      "number": 7,
      "arabic": "يَا أَيُّهَا الَّذِينَ كَفَرُوا لَا تَعْتَذِرُوا الْيَوْمَ ۖ إِنَّمَا تُجْزَوْنَ مَا كُنتُمْ تَعْمَلُونَ",
      "transliteration": "Ya ayyuha alladhina kafaru la ta'tadhiru al-yawma innama tujzawna ma kuntum ta'malun",
      "translation": "O you who have disbelieved, make no excuses that Day. You will only be recompensed for what you used to do"
    },
    {
      "number": 8,
      "arabic": "يَا أَيُّهَا الَّذِينَ آمَنُوا تُوبُوا إِلَى اللَّهِ تَوْبَةً نَّصُوحًا عَسَىٰ رَبُّكُمْ أَن يُكَفِّرَ عَنكُمْ سَيِّئَاتِكُمْ وَيُدْخِلَكُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ يَوْمَ لَا يُخْزِي اللَّهُ النَّبِيَّ وَالَّذِينَ آمَنُوا مَعَهُ ۖ نُورُهُمْ يَسْعَىٰ بَيْنَ أَيْدِيهِمْ وَبِأَيْمَانِهِمْ يَقُولُونَ رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا ۖ إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "transliteration": "Ya ayyuha alladhina amanu tubu ila allahi tawbatan nasuhan 'asa rabbukum an yukaffira 'ankum sayyi'atikum wa yudkhilakum jannatin tajri min tahtiha al-anharu yawma la yukhzi allahu an-nabiyya wa alladhina amanu ma'ahu nuruhum yas'a bayna aydihim wa bi-aymanihim yaquluna rabbana atmim lana nurana wa-ghfir lana innaka 'ala kulli shay'in qadir",
      "translation": "O you who have believed, repent to Allah with sincere repentance. Perhaps your Lord will remove from you your misdeeds and admit you into gardens beneath which rivers flow [on] the Day when Allah will not disgrace the Prophet and those who believed with him. Their light will proceed before them and on their right; they will say, 'Our Lord, perfect for us our light and forgive us. Indeed, You are over all things competent'"
    },
    {
      "number": 9,
      "arabic": "يَا أَيُّهَا النَّبِيُّ جَاهِدِ الْكُفَّارَ وَالْمُنَافِقِينَ وَاغْلُظْ عَلَيْهِمْ ۚ وَمَأْوَاهُمْ جَهَنَّمُ ۖ وَبِئْسَ الْمَصِيرُ",
      "transliteration": "Ya ayyuha an-nabiyyu jahidi al-kuffara wa al-munafiqina wa-ghluz 'alayhim wa ma'wahum jahannamu wa bi'sa al-masir",
      "translation": "O Prophet, fight against the disbelievers and the hypocrites and be harsh upon them. And their refuge is Hell, and wretched is the destination"
    },
    {
      "number": 10,
      "arabic": "ضَرَبَ اللَّهُ مَثَلًا لِّلَّذِينَ كَفَرُوا امْرَأَتَ نُوحٍ وَامْرَأَتَ لُوطٍ ۖ كَانَتَا تَحْتَ عَبْدَيْنِ مِنْ عِبَادِنَا صَالِحَيْنِ فَخَانَتَاهُمَا فَلَمْ يُغْنِيَا عَنْهُمَا مِنَ اللَّهِ شَيْئًا وَقِيلَ ادْخُلَا النَّارَ مَعَ الدَّاخِلِينَ",
      "transliteration": "Daraba allahu mathalan li-alladhina kafaru imra'ata nuhin wa imra'ata lutin kanata tahta 'abdayni min 'ibadina salihayni fa-khanatahuma fa-lam yughniya 'anhuma mina allahi shay'an wa qila udkhula an-nara ma'a ad-dakhilin",
      "translation": "Allah presents an example of those who disbelieved: the wife of Noah and the wife of Lot. They were under two of Our righteous servants but betrayed them, so those prophets did not avail them from Allah at all, and it was said, 'Enter the Fire with those who enter'"
    },
    {
      "number": 11,
      "arabic": "وَضَرَبَ اللَّهُ مَثَلًا لِّلَّذِينَ آمَنُوا امْرَأَتَ فِرْعَوْنَ ۚ إِذْ قَالَتْ رَبِّ ابْنِ لِي عِندَكَ بَيْتًا فِي الْجَنَّةِ وَنَجِّنِي مِن فِرْعَوْنَ وَعَمَلِهِ وَنَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ",
      "transliteration": "Wa daraba allahu mathalan li-alladhina amanu imra'ata fir'awna idh qalat rabbi ibni li 'indaka baytan fi al-jannati wa najjini min fir'awna wa 'amalihi wa najjini mina al-qawmi az-zalimin",
      "translation": "And Allah presents an example of those who believed: the wife of Pharaoh, when she said, 'My Lord, build for me near You a house in Paradise and save me from Pharaoh and his deeds and save me from the wrongdoing people'"
    },
    {
      "number": 12,
      "arabic": "وَمَرْيَمَ ابْنَتَ عِمْرَانَ الَّتِي أَحْصَنَتْ فَرْجَهَا فَنَفَخْنَا فِيهِ مِن رُّوحِنَا وَصَدَّقَتْ بِكَلِمَاتِ رَبِّهَا وَكُتُبِهِ وَكَانَتْ مِنَ الْقَانِتِينَ",
      "transliteration": "Wa maryama ibnata 'imrana allati ahsanat farjah fa-nafakhna fihi min ruhina wa saddaqat bi-kalimati rabbiha wa kutubihi wa kanat mina al-qanitin",
      "translation": "And [the example of] Mary, the daughter of 'Imran, who guarded her chastity, so We blew into [her garment] through Our angel [Gabriel], and she believed in the words of her Lord and His scriptures and was of the devoutly obedient"
    }
  ]
}
